Repository: adax/qookery
Catalog: qookery/source/translation/*.po
Languages: el

# qookery.internal.validators.ArrayValidator.minimumLength
source: Not enough elements in array, at least %1 are needed
el: Δεν υπάρχουν αρκετά στοιχεία στον πίνακα, απαιτούνται τουλάχιστον %1

# qookery.internal.validators.ArrayValidator.maximumLength
source: Number of elements in array exceed maximum allowed of %1
el: Υπάρχουν περισσότερα από %1 στοιχεία στον πίνακα

# qookery.internal.validators.ComparisonValidator.eq
source: Value must be equal to %1
el: H τιμή πρέπει να ισούται με %1

# qookery.internal.validators.ComparisonValidator.ne
source: Value must not be equal to %1
el: H τιμή δεν πρέπει να ισούται με %1

# qookery.internal.validators.ComparisonValidator.gt
source: Value must be greater than %1
el: H τιμή πρέπει να είναι μεγαλύτερη από %1

# qookery.internal.validators.ComparisonValidator.ge
source: Value must be greater than or equal with %1
el: H τιμή πρέπει να είναι μεγαλύτερη ή ίση με %1

# qookery.internal.validators.ComparisonValidator.le
source: Value must be less than or equal with %1
el: H τιμή πρέπει να είναι μικρότερη ή ίση με %1

# qookery.internal.validators.ComparisonValidator.lt
source: Value must be less than %1
el: H τιμή πρέπει να είναι μικρότερη από %1

# qookery.internal.validators.NotNullValidator.invalidMessage
source: Required value is missing
el: Λείπει απαιτούμενη τιμή

# qookery.internal.validators.StringValidator.regularExpression
source: Text does not match expected pattern
el: Το κείμενο δεν είναι στην αναγκαία μορφή

# qookery.internal.validators.StringValidator.minimumLength
source: Text is not long enough, at least %1 characters are needed
el: Το μήκος του κειμένου δεν είναι επαρκές, απαιτούνται %1 χαρακτήρες

# qookery.internal.validators.StringValidator.maximumLength
source: Text is exceeds maximum length of %1
el: Το μήκος του κειμένου υπερβαίνει το όριο των %1 χαρακτήρων

# qookery.internal.components.FormComponent.validationErrors
source: Error(s) encountered during form '%1' validation
el: Εντοπίσθηκαν σφάλματα εγκυρότητας κατά τον έλεγχο της φόρμας

# qookery.internal.components.EditableComponent.componentError
source: Field '%1'
el: Πεδίο «%1»
